[
  {
    "title": "Hindutva BJP has turned India into a dangerous place for minorities: Report",
    "source": "Kashmir Media Service",
    "date": "2025-09-07",
    "summary": "A report compiled by Kashmir Media Service highlights how India under BJP rule has become dangerous for minorities, with Muslims, Christians and Dalits facing systematic discrimination. The report warns of impending genocide of Muslims and notes that Islamophobia has taken its most lethal form with Hindutva leaders openly calling for mass killings.",
    "url": "https://kmsnews.org/kms/2025/09/07/hindutva-bjp-has-turned-india-into-a-dangerous-place-for-minorities-report.html"
  },
  {
    "title": "India: Ongoing detention of activists without bail, criminalisation of dissent and ban on books",
    "source": "CIVICUS Monitor",
    "date": "2025-09-08",
    "summary": "CIVICUS Monitor reports on India's continued targeting of activists and civil society organizations using draconian anti-terror laws. The report documents allegations of enforced disappearances and torture of student activists in Delhi, with activists being stripped, beaten, electrocuted and subjected to degrading treatment including threats of sexual violence.",
    "url": "https://monitor.civicus.org/explore/india-ongoing-detention-of-activists-without-bail-criminalisation-of-dissent-and-ban-on-books/"
  },
  {
    "title": "Claims of reform, record of repression: The BJP and the Waqf Act",
    "source": "The News Minute",
    "date": "2025-09-10",
    "summary": "The article analyzes the 2025 Waqf Amendment Act, arguing it represents a dangerous turning point that undermines constitutional rights of Muslims and weakens federalism. The law introduces bureaucratic interference in religious autonomy and creates potential for politically motivated dispossession of Waqf properties, fitting within BJP's broader campaign to reshape India's secular democratic fabric.",
    "url": "https://www.thenewsminute.com/amp/story/voices/claims-of-reform-record-of-repression-the-bjp-and-the-waqf-act"
  }
]

